# PocheMatId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PocheMatId Property
ParameterTypeId Class See Also
---
"Coarse Poche Material"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PocheMatId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PocheMatId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PocheMatId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace